other_tools/openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|k|omega|e|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }
    "(U|e)"
    {
        solver          PBiCGStab;
        preconditioner  diagonal;
        tolerance       1e-7;
        relTol          0.1;
    }

	"(rho|rhoU|rhoE)"
	{
		solver	diagonal;
	}

	k//U
	{
		solver	smoothSolver;
		smoother	GaussSeidel;
		nSweeps	2;
		tolerance	1e-09;
		relTol	0;
	}

	h
	{
		$U	;
		tolerance	1e-010;
		relTol	0;
	}


}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|e)"   1e-4;
    }

    nNonOrthogonalCorrectors 0;
    pMinFactor      0.1;
    pMaxFactor      2;
}

relaxationFactors
{
    fields
    {
        p               0.7;
        rho             0.01;
    }
    equations
    {
        U               0.3;
        e               0.7;
        "(k|omega|nuTilda)"     0.7;
    }
}

// ************************************************************************* //
